---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceLoadData.ExternalResourceType
source: html/c66319f6-976e-2221-14bc-8b88088509ac.htm
---
# Autodesk.Revit.DB.ExternalResourceLoadData.ExternalResourceType Property

The ExternalResourceType for which Revit is requesting data from the server.

## Syntax (C#)
```csharp
public ExternalResourceType ExternalResourceType { get; }
```